In [1]:
import pandas as pd

# series

In [2]:
arr = [0,1,2,3,4]
s1 = pd.Series(arr)
s1

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [3]:
order=[1,2,3,4,5]
s2 = pd.Series(arr,index=order)
s2

1    0
2    1
3    2
4    3
5    4
dtype: int64

In [4]:
import numpy as np
n = np.random.randn(5)
index=['a','b','c','d','e']
s2 = pd.Series(n,index=index)
s2

a   -2.682078
b   -0.744268
c    0.594858
d    0.517624
e   -0.417986
dtype: float64

In [5]:
d = {'a':1,'b':2,'c':3,'d':4,'e':5}
s3 = pd.Series(d)
s3

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [14]:
s1.index = ['A','B','C','D','E']
s1

A    0
B    1
C    2
D    3
E    4
dtype: int64

# slicing

In [15]:
print(s1[:3])
print(s1[:-1])
print(s1[-2:])

A    0
B    1
C    2
dtype: int64
A    0
B    1
C    2
D    3
dtype: int64
D    3
E    4
dtype: int64

In [20]:
s4 = pd.concat([s1, s3])
s4

A    0
B    1
C    2
D    3
E    4
a    1
b    2
c    3
d    4
e    5
dtype: int64

In [21]:
s4.drop('e')

A    0
B    1
C    2
D    3
E    4
a    1
b    2
c    3
d    4
dtype: int64

# series operations

In [22]:
arr1 = [0,1,2,3,4,5,7]
arr2 = [6,7,8,9,5]

In [23]:
s5 = pd.Series(arr2)
s5

0    6
1    7
2    8
3    9
4    5
dtype: int64

In [24]:
s6 = pd.Series(arr1)
s6

0    0
1    1
2    2
3    3
4    4
5    5
6    7
dtype: int64

In [25]:
s5.add(s6)

0     6.0
1     8.0
2    10.0
3    12.0
4     9.0
5     NaN
6     NaN
dtype: float64

In [26]:
s5.sub(s6)

0    6.0
1    6.0
2    6.0
3    6.0
4    1.0
5    NaN
6    NaN
dtype: float64

In [32]:
s7 = s5.multiply(s6)
s7

0     0.0
1     7.0
2    16.0
3    27.0
4    20.0
5     NaN
6     NaN
dtype: float64

In [29]:
s5.div(s6)

0     inf
1    7.00
2    4.00
3    3.00
4    1.25
5     NaN
6     NaN
dtype: float64

In [33]:
print('median',s7.median())
print('max',s7.max())
print('min',s7.min())
print('mean',s7.mean())

median 16.0
max 27.0
min 0.0
mean 14.0

# dataframe

In [37]:
dates = pd.date_range('today',periods=6)
num_arr = np.random.randn(6,4)
cols = ['A','B','C','D']

df = pd.DataFrame(num_arr,index=dates,columns=cols)
df

                                   A         B         C         D
2024-03-06 11:31:11.960146 -1.407728 -0.664209  0.374507  0.161292
2024-03-07 11:31:11.960146 -1.271023 -0.075178  0.145842 -0.841506
2024-03-08 11:31:11.960146 -0.443552 -0.991645  1.473910 -1.120473
2024-03-09 11:31:11.960146 -2.276910 -0.703557 -0.046381  0.877126
2024-03-10 11:31:11.960146 -1.332599 -0.380232  0.161806  0.607067
2024-03-11 11:31:11.960146 -0.506334 -0.477426  0.916846 -1.139385

In [38]:
data = {
    'animal':['cat','dog','tiger','lion','cheetah'],
    'age':[2.5,3,4,5,8],
    'visits':[1,2,3,4,5],
    'pri':['yes','no','no','yes','yes']}
labels=['a','b','c','d','e']
df1 = pd.DataFrame(data,index=labels)
df1

    animal  age  visits  pri
a      cat  2.5       1  yes
b      dog  3.0       2   no
c    tiger  4.0       3   no
d     lion  5.0       4  yes
e  cheetah  8.0       5  yes

In [39]:
df1.dtypes

animal     object
age       float64
visits      int64
pri        object
dtype: object

In [40]:
df1.head()

    animal  age  visits  pri
a      cat  2.5       1  yes
b      dog  3.0       2   no
c    tiger  4.0       3   no
d     lion  5.0       4  yes
e  cheetah  8.0       5  yes

In [42]:
df1.tail(2)

    animal  age  visits  pri
d     lion  5.0       4  yes
e  cheetah  8.0       5  yes

In [44]:
print(df1.index)
print(df1.columns)

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')
Index(['animal', 'age', 'visits', 'pri'], dtype='object')

In [45]:
df1.values

array([['cat', 2.5, 1, 'yes'],
       ['dog', 3.0, 2, 'no'],
       ['tiger', 4.0, 3, 'no'],
       ['lion', 5.0, 4, 'yes'],
       ['cheetah', 8.0, 5, 'yes']], dtype=object)

In [46]:
df1.describe()

            age    visits
count  5.000000  5.000000
mean   4.500000  3.000000
std    2.179449  1.581139
min    2.500000  1.000000
25%    3.000000  2.000000
50%    4.000000  3.000000
75%    5.000000  4.000000
max    8.000000  5.000000

In [47]:
df1.T

          a    b      c     d        e
animal  cat  dog  tiger  lion  cheetah
age     2.5  3.0    4.0   5.0      8.0
visits    1    2      3     4        5
pri     yes   no     no   yes      yes

In [51]:
df1.sort_values(by="age")

    animal  age  visits  pri
a      cat  2.5       1  yes
b      dog  3.0       2   no
c    tiger  4.0       3   no
d     lion  5.0       4  yes
e  cheetah  8.0       5  yes

In [52]:
df1[1:3]

  animal  age  visits pri
b    dog  3.0       2  no
c  tiger  4.0       3  no

In [53]:
df1[['age','visits']]

   age  visits
a  2.5       1
b  3.0       2
c  4.0       3
d  5.0       4
e  8.0       5

In [54]:
df1.iloc[1:3]

  animal  age  visits pri
b    dog  3.0       2  no
c  tiger  4.0       3  no

In [55]:
df2 = df1.copy()
df2

    animal  age  visits  pri
a      cat  2.5       1  yes
b      dog  3.0       2   no
c    tiger  4.0       3   no
d     lion  5.0       4  yes
e  cheetah  8.0       5  yes

In [56]:
df2.isnull()

   animal    age  visits    pri
a   False  False   False  False
b   False  False   False  False
c   False  False   False  False
d   False  False   False  False
e   False  False   False  False

In [57]:
df2.loc['d','age']=6.7
df2

    animal  age  visits  pri
a      cat  2.5       1  yes
b      dog  3.0       2   no
c    tiger  4.0       3   no
d     lion  6.7       4  yes
e  cheetah  8.0       5  yes

In [58]:
df1[['age']].mean()

age    4.5
dtype: float64

In [60]:
df1['visits'].sum()

15

In [61]:
df1.sum()

animal    catdogtigerlioncheetah
age                         22.5
visits                        15
pri                yesnonoyesyes
dtype: object

In [62]:
string = pd.Series(['A','C','D','Aaa','BaCa',np.nan,'CBA','cow','owl'])
string

0       A
1       C
2       D
3     Aaa
4    BaCa
5     NaN
6     CBA
7     cow
8     owl
dtype: object

In [65]:
print(string.str.lower())
print(string.str.upper())

0       a
1       c
2       d
3     aaa
4    baca
5     NaN
6     cba
7     cow
8     owl
dtype: object
0       A
1       C
2       D
3     AAA
4    BACA
5     NaN
6     CBA
7     COW
8     OWL
dtype: object

# operations for dataframe missing values

In [69]:
df3 = df1.copy()
ma = df3['age'].mean()
df3.fillna(ma)

    animal  age  visits  pri
a      cat  2.5       1  yes
b      dog  3.0       2   no
c    tiger  4.0       3   no
d     lion  5.0       4  yes
e  cheetah  8.0       5  yes

In [70]:
df4 = df3.copy()
df4.dropna(how='any')

    animal  age  visits  pri
a      cat  2.5       1  yes
b      dog  3.0       2   no
c    tiger  4.0       3   no
d     lion  5.0       4  yes
e  cheetah  8.0       5  yes

# file operations

In [71]:
df1.to_csv('animal.csv')

In [72]:
df_ani = pd.read_csv('animal.csv')
df_ani

  Unnamed: 0   animal  age  visits  pri
0          a      cat  2.5       1  yes
1          b      dog  3.0       2   no
2          c    tiger  4.0       3   no
3          d     lion  5.0       4  yes
4          e  cheetah  8.0       5  yes

In [73]:
df1.to_excel('animal.xlsx',sheet_name='Sheet1')
df_ani1 = pd.read_excel('animal.xlsx','Sheet1',index_col=None,na_values=['NA'])
df_ani1

  Unnamed: 0   animal  age  visits  pri
0          a      cat  2.5       1  yes
1          b      dog  3.0       2   no
2          c    tiger  4.0       3   no
3          d     lion  5.0       4  yes
4          e  cheetah  8.0       5  yes